{
    "projects":[
        {
            "name": "Tune Tailor",
            "subdomain": "tuneTailor",
            "skills": ["Software", "React.js", "Git", "Node.js", "Express.js", "MongoDB", "Mongoose", "Tailwind", "API", "React Router", "Session Management", "Full Stack"],
            "subtitle": "A Desktop-Focused Application to Simplify Liked Songs Modifications for Spotify User's",
            "collaborators": [],
            "description": [
                "The motivation behind Tune Tailor was driven by a strong desire to clean up my Spotify liked songs. My love for music combined with years of listening resulted in my Spotify liked songs accumulating over 10,000 tracks. Wanting to condense my liked songs to more accurately reflect my current music taste and with no simple way to create mass modifications via Spotify, Tune Tailor began development.",
                "The technology which drives the project is as follows: ", 
                "Frontend: React.js, React Router, Tailwind",
                "Backend: Express.js, Node.js",
                "Database: Mongoose, MongoDB",
                "The application heavily interacts with the Spotify API which provides an interface to request user profile information, liked songs data, playlist data, and top track data. Notably, Tune Tailor utilizes Spotify's authorization flow to register users with the application and leverages Spotify user's playlist and top track data as the primary avenues for modifications to their liked songs.",
                "My application improves upon the capabilities of the Spotify application by providing a UI which better enables user's to make large modifications to their liked songs efficiently. For instance, for the liked songs and top track pages, each track is clickable and many tracks can be selected simultaneously allowing the user to add or remove each selected track with a simple button click. Additionally, the user is also presented a button allowing them to remove all tracks from their liked songs immediately."
            ],
            "abstract": "A solo software project which strives to provide a cleaner interface for making modification to Spotify Liked Songs. The project utilizes Tailwind, React Router and the MERN stack alongside the Spotify API as a means of achieving this functionality.", 
            "images": ["../img/projects/tuneTailor/authorize.png", "../img/projects/tuneTailor/selectedTracks.png", "../img/projects/tuneTailor/signIn.png", "../img/projects/tuneTailor/topTracks.png"],
            "completed": false
        },
        {
            "name": "Polymorphia",
            "subdomain": "polymorphia",
            "skills": ["Software", "Java", "Object-Oriented Design", "Object-Oriented Programming", "Test Driven Development", "Design Patterns", "Behavior Driven Development", "Git", "Gradle"],
            "subtitle": "An Object-Oriented Interactive Game Developed in Java via TDD",
            "collaborators": [],
            "description": [],
            "abstract": "An object-oriented game built in Java. The game features a maze consisting of a varying number of rooms, adventurers, creatures, and items. Development of the game was driven through testing via JUnit and expansions to the game provided opportunities to refactor and implement object-oriented design patterns to simplify complexity.",
            "images": ["../img/projects/polymorphia/apiGame.png", "../img/projects/polymorphia/apiGameMiddleTurn.png", "../img/projects/polymorphia/defaultServer.png", "../img/projects/polymorphia/mazeObserver.png", "../img/projects/polymorphia/UML.png"],
            "completed": false
        },
        {
            "name": "Portland Indigenous Marketplace Project",
            "subdomain": "pim",
            "skills": ["Software", "React.js", "Tailwind.js", "Axios", "Git", "Team", "Docker"],
            "subtitle": "A Mobile Focused Application to Improve Vendor and Event Management for Portland Indigenous Marketplace",
            "collaborators": ["Nick Henley", "Harley Ewert", "Jeremy Varghese", "Justin Goh", "Eric Fithian"],
            "description": ["test1", "test2"],
            "abstract": "The Portland Indigenous Marketplace Project is a mobile-focused application developed using React.js, React Router, Express.js, Node.js, and PostgreSQL. Through these technologies, we sought to deliver a consolidated platform to the executives of the Portland Indigenous Marketplace non profit to improve their ability to manage vendors and events. The project is one amongst several projects created through the Blueprint Boulder organization.",
            "images": ["../img/projects/pim/editEvent.png", "../img/projects/pim/event.png"],
            "completed": true
        },
        {
            "name": "Palette5",
            "subdomain": "palette",
            "skills": ["Software", "HTML", "Bootstrap", "Handlebars.js", "Axios", "Docker", "Git", "Team Programming", "Postgres", "Node.js", "Express.js", "Agile", "API", "Full Stack"],
            "subtitle": "An Art-Focused Software Application",
            "collaborators": [],
            "description": [],
            "abstract": "A group software project which sought to immerse themselves in the art world through discovery, events, and artist related pages. The application utilized Bootstrap, Handlebars.js, Express.js, Node.js, PostgreSQL to deliver dynamically rendered content, handle external API calls, and execute database operations.",
            "images": ["../img/projects/palette/collectionProfile.png", "../img/projects/palette/discoverP1.png", "../img/projects/palette/oneArtworkAdded.png", "../img/projects/palette/relatedArtComments.png"],
            "completed": true
        },
        {
            "name": "Cook County Data Science Project",
            "subdomain": "cookCounty",
            "skills": ["Python", "NumPy", "Scikit-learn", "Pandas", "Data Exploration", "Data Analysis", "Data Cleaning"],
            "subtitle": "Investigating Cook County Housing Data to Form Predictive Models",
            "collaborators": [],
            "description": [],
            "abstract": "With a history of racial discrimination in housing policy and property taxation, the project sought to explore over 500,000 housing records in Cook County, Illinois. The exploration of the dataset culminated in the creation of several linear regression models to more accurately predict home prices within the county.",
            "images": ["../img/projects/cookCounty/linearRegression.png", "../img/projects/cookCounty/model3.png", "../img/projects/cookCounty/model3Visual.png"],
            "completed": true
        },
        {
            "name": "Goudy Type Specimen",
            "subdomain": "typeSpecimen",
            "skills": ["Design", "Adobe Illustrator", "Type Design", "Creativity"],
            "subtitle": "An Exhibition of the Typeface Goudy Old Style",
            "collaborators": [],
            "description": [],
            "abstract": "Designed using Adobe Illustrator, the Goudy Type Specimen seeks to provide an aesthetically pleasing presentation of the typeface Goudy Old Style designed by Frederic W. Goudy. The type specimen displays the core of the typeface, exhbiting all characters A-Z and 0-9 alongside several notable characters outside this grouping.",
            "images": ["../img/projects/typeSpecimen/finalGoudy.jpg", "../img/projects/typeSpecimen/firstGoudy.jpg"],
            "completed": true
        },
        {
            "name": "Typographic Calendar",
            "subdomain": "typeCalendar",
            "skills": ["Design", "Team", "Adobe Illustrator", "Type Design", "Creativity"],
            "subtitle": "A 2025 Calendar Inspired by the Record Player",
            "collaborators": [],
            "description": [],
            "abstract": "Title Track 2025, our typographic calendar emphasizes the continuous motion of time underscored by record players. Each month represents a side of the record where the typographic-focused design centered around qualities of the respective month.",
            "images": ["../img/projects/typeCalendar/april.jpg", "../img/projects/typeCalendar/july.jpg", "../img/projects/typeCalendar/september.jpg", "../img/projects/typeCalendar/october.jpg"],
            "completed": true
        }
    ]
}